       01  DISP-ARGS.

           05  DISP-X          PIC S9(4).
           05  DISP-Y          PIC S9(4).

           05  DISP-R          PIC S9(3).
           05  DISP-G          PIC S9(3).
           05  DISP-B          PIC S9(3).

           
